#+title: No build static site that used supabase
#+subtitle: who needs tooling
#+tags[]: supabase nobuild static_site
#+date: 2024-09-02T21:34:42
#+remote:   https://github.com/wschenk/supabase-auth-test

* Setup supabase

For our local build, we can see what the settings are by:

#+begin_src bash :results output
supabase status -o env | cut -c1-80
#+end_src

#+RESULTS:
#+begin_example
ANON_KEY="eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZS1kZW1vIiwic
API_URL="http://127.0.0.1:54321"
DB_URL="postgresql://postgres:postgres@127.0.0.1:54322/postgres"
GRAPHQL_URL="http://127.0.0.1:54321/graphql/v1"
INBUCKET_URL="http://127.0.0.1:54324"
JWT_SECRET="super-secret-jwt-token-with-at-least-32-characters-long"
S3_PROTOCOL_ACCESS_KEY_ID="625729a08b95bf1b7ff351a663f3a23c"
S3_PROTOCOL_ACCESS_KEY_SECRET="850181e4652dd023b7a98c58ae0d2d34bd487ee0cc3254aed
S3_PROTOCOL_REGION="local"
SERVICE_ROLE_KEY="eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZS1kZ
STORAGE_S3_URL="http://127.0.0.1:54321/storage/v1/s3"
STUDIO_URL="http://127.0.0.1:54323"
#+end_example

We'll need the =API_URL= and the =ANON_KEY=

Lets set up =db.js=

#+begin_src javascript 
  // db.js
  import { createClient } from "https://cdn.jsdelivr.net/npm/@supabase/supabase-js/+esm";

  let api_url="http://127.0.0.1:54321";
  let anon_key="eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZS1kZW1vIiwicm9sZSI6ImFub24iLCJleHAiOjE5ODM4MTI5OTZ9.CRXP1A7WOeoJeXxjNni43kdQwgnWNReilDMblYTn_I0"

  export const supabase = createClient(api_url, anon_key);
#+end_src

And then add a notify function so we can pop stuff up on the screen
and annoy people:

#+begin_src javascript :tangle notify.js
  // notify.js
  // Always escape HTML for text arguments!
  export function escapeHtml(html) {
      const div = document.createElement("div");
      div.textContent = html;
      return div.innerHTML;
  }

  // Custom function to emit toast notifications
  export async function notify(
      message,
      variant = "primary",
      icon = "info-circle",
      duration = 3000
  ) {
      const alert = Object.assign(document.createElement("sl-alert"), {
          variant,
          closable: true,
          duration: duration,
          innerHTML: `
          <sl-icon name="${icon}" slot="icon"></sl-icon>
          ${escapeHtml(message)}
        `,
      });
      document.body.append(alert);
      setTimeout(() => {
          alert.toast();
      }, 250);
  }
#+end_src

* Database

Lets create a =posts= table:

#+begin_src bash
  supabase migration new posts
#+end_src

And then write the sql:

#+begin_src sql :tangle supabase/migrations/20240902234248_posts.sql
create table posts (
  id bigint generated by default as identity primary key,
  title text,
  body text,
  user_id uuid references auth.users,
  created_at timestamp with time zone default now(),
  updated_at timestamp with time zone default now()
);

-- 2. Enable RLS
alter table posts enable row level security;

-- select policy
create policy "Posts are visible to everyone."
on posts for select
to anon, authenticated -- the Postgres Role (recommended)
using ( true ); -- the actual Policy

-- insert policy
create policy "Users can create a post."
on posts for insert
to authenticated
with check ( auth.uid() is not null );
#+end_src

Go to the [[http://127.0.0.1:54323/project/default/editor][local table view]] to see the before, and then run

#+begin_src bash :results output
  supabase migration up
#+end_src

#+RESULTS:
: Connecting to local database...
: Applying migration 20240902234248_posts.sql...
: Local database is up to date.

To see the after

